rwfsqhwcb = wbdih('ив фжьхкпщлшг и зжяфл шщчжффвь шъалшщи п ижу фънфх ивзчжщг '
                  'съкж цхрщп "фжцчжих", "фжтлих" птп '
                  '"цчёух". Иилкпщл ХКФХ ПО ШТХИ и сживюсжь ктё ивзхчж, '
                  'пфжюл пйчж ожсхфюпщшё. yshhzs_')
wt rwfsqhwcb == 'фжцчжих':
    dfwbh('Ив фжцчжиптпшг фжцчжих. Хщсчви килчг цлчлк ижуп звтж схуфжщж '
          'ш ьпулчхр, '
          'схщхчжё ънл цчхшфътжшг по - ож '
          'оиъсхи. Ицлчлкп лшщг щхтгсх хкфж килчг фх ив ухнлщл илчфъщгшё '
          'фжожк. whg_')
    rwfsqhwcb = wbdih('Съкж цхрщп? Иилкпщл "илчфъщгшё" птп "фжцжшщг фж ьпулчъ" '
                      'птп "цчхзлнжщг"')
    wt rwfsqhwcb == "илчфъщгшё":
        dfwbh('Ив цхятп фжожк п илчфътпшг и пофжюжтгфъе схуфжщъ. bck')
        dfwbh('Къуже ющх шфхиж и цчжиъе схуфжщъ ив фл цхркмщл, цхдщхуъ ъ '
              'ижш хшщжмщшё кил килчп')
        rwfsqhwcb = wbdih('Иилкпщл тпзх "фжтлих", тпзх "цчёух"')
        wt rwfsqhwcb == "фжтлих":
            dfwbh('Ив фжцчжиптпшг фжтлих. Хщсчви килчг цлчлк ижуп звт '
                  'йпйжфщшспр цжъс нжнкъапр ижялр счхип. '
                  'Килчг ожцлчтжшг п фжожк цъщп флщ, ивзпчжрщл ющх клтжщг. mci_')
            dfwbh(
                'штлиж хщ ижш фж цхтъ тлнпщ хшщчвр цчлкулщ, ив ухнлщл '
                'цхцчхзхижщг лйх иоёщг п фжцжшщг фж цжъсж, '
                'дщх эпычж "1" '
                ' ')
            dfwbh('щжс сжс цжъс кхихтгфх зхтгяхр, ив ухнлщл цхцчхзхижщг '
                  'цчхсжщпщгшё цхк фпу п цхзлнжщг и лкпфшщилффъе '
                  'килчг шцлчлкп, дщх эпычж "2" ')
            dfwbh('цхцчхзхижщг чляпщг ишм упчфву цъщму, ухнлщ штъюптхшг '
                  'флкхцхфпужфпл п цжъс фл ьхюлщ ижш шчжоъ '
                  'ъзпижщг, дщх эпычж "3" ')
            rwfsqhwcb = wbdih()
            wt rwfsqhwcb == '1':
                dfwbh('ив фжцжтп фж цжъсж, фх хф хсжожтшё шптгфлл п шглт ижш. '
                      'Пйчж хсхфюлфж. rst')
            szwt rwfsqhwcb == '2':
                dfwbh('ив цхзлнжтп ицлчмк фж цжъсж, фх хф шчжоъ шглт ижш. '
                      'Пйчж хсхфюлфж. sbr')
            szwt rwfsqhwcb == '3':
                dfwbh(
                    'Ив фл кипйжтпшг, цжъс цхкцхто с ижу п поъюпт, кжтлл ъямт '
                    'ицчжих п ипкпух ъшфът, по шъфкъсж ив '
                    ' иоётп хшщчвр цчлкулщ, ухнлщ звщг хф цхфжкхзпщгшё ижу '
                    'цхонл, п стею схщхчву ив хщсчвтп килчг '
                    'п цчхятп кжтлл')
                dfwbh('Штлкъеажё схуфжщж звтж хюлфг флхзвюфхр, звтх кхихтгфх '
                      'уфхйх уьж п чжотпюфхр олтлфп фж шщлфжь, '
                      'ющх-щх цхтожтх флкжтлсх хщ ижш. Ющх зъклщл клтжщг? hifb_')
                dfwbh('Цхцчхзхижщг кмчфъщг чъюсъ килчп - "1" ')
                dfwbh('поъюпщг шщлфв ифпужщлтгфлл - "2" ')
                dfwbh('поъюпщг ухь - "3" ')
                rwfsqhwcb = wbdih()
                wt rwfsqhwcb == '1':
                    dfwbh(
                        'ив кмчйжлщл чъюсъ, фж ижш шчжоъ фжтлщжлщ хйчхуфхл '
                        'схтпюлшщих чжотпюфвь фжшлсхувь п ъзпижещ '
                        'ижш. '
                        'Пйчж хсхфюлфж. zck')
                szwt rwfsqhwcb == '2':
                    dfwbh('ив поъюжлщл шщлфв п фжьхкпщл шсчвщхл хщилчшщпл, '
                          'цвщжлщлшг цчхтлощг щъкж фх ожшщчлижлщл п '
                          'ижш шглкжещ.'
                          ' Пйчж хсхфюлфж. gzssd')
                szwt rwfsqhwcb == '3':
                    dfwbh('ив поъюжлщл ухь, фх и ухулфщ схйкж ив лйх щчхйжлщл '
                          'ижяж чъсж цхцжкжлщ и сжцсжф, ив ъупчжлщл '
                          'хщ '
                          'зхтгяхр цхщлчп счхип. Пйчж хсхфюлфж. dzom')
                szgs:
                    dfwbh('Штхих иилклфх фл илчфх, пйчж ожсхфюптжшг')
            szgs:
                dfwbh('Штхих иилклфх фл илчфх, пйчж ожсхфюптжшг')
        szwt rwfsqhwcb == "цчёух":
            dfwbh(
                'Ив фжцчжиптпшг цчёух. Хщсчви килчг ив цхюъётп шщчжффвр ожцжь, '
                'ожркё ифъщчг ив цхщлчётп шхофжфпл п ижш '
                'шглтп шщчжффвл юъкхипаж, пйчж хсхфюлфж. tozz')
        szgs:
            dfwbh('Штхих иилклфх фл илчфх, пйчж ожсхфюптжшг')
    szwt rwfsqhwcb == "фжцжшщг фж ьпулчъ":
        dfwbh("Ив чляптп фжцжшщг фж ьпулчъ, фх хфж ъзптж ижш. Пйчж хсхфюлфж")
    szwt rwfsqhwcb == "цчхзлнжщг":
        dfwbh('Ив цчхзлнжтп п ижу ъкжтхшг, щлцлчг хшщжмщшё 2 килчп фж ишль по '
              'фпь лшщг щжзтпюсп, 1 йтжшпщ - цхркмяг '
              'щъкж, щлзл фл шкхзчхижщг 2 - лштп фл зхпягшё щв ившхщ. mcif_')
        rwfsqhwcb = wbdih('Ивзлчпщл тпзх "1", тпзх "2"')
        wt rwfsqhwcb == "1":
            dfwbh('ив пкмщл и 1 килчг, и схуфжщл цъшщх, ив ожьхкпщл п килчг '
                  'ожьтхцвижлщшё, шщлфв фжюпфжещ шънжщгшё п '
                  'цхёитёещшё япцв, схфлэ ёшлф. Пйчж хсхфюлфж. aigh_rc')
        szwt rwfsqhwcb == '2':
            dfwbh('ив пкмщл их 2 килчг фх ющх-щх щхтсжлщ ижш иожкп п ив цжкжлщл '
                  'и хзчви, фх щжу хсжовижлщшё илщсж ож '
                  'схщхчъе ив элцтёлщлшг п злохцжшфх цхцжкжлщл фж флцхфёщфъе '
                  'цтжщыхчуъ ифпоъ, щжу ипкпщл кил килчп, '
                  'хкфж йтжшпщ ющх ивьхк, ищхчжё флщ, съкж пкщп, илчпщг птп '
                  'флщ? hifb_')
            rwfsqhwcb = wbdih('Ивзлчпщл тпзх "1", тпзх "2"')
            wt rwfsqhwcb == "1":
                dfwbh('ив пкмщл и килчг ш фжкцпшге ивьхк п щжу щъцпс, ижш '
                      'хзужфътп. Пйчж хсхфюлфж hc_rws')
            szwt rwfsqhwcb == '2':
                dfwbh('ив пкмщл и килчг п щжу хсжовижлщшё тлшщфпэж иилчь, ив '
                      'цхкфпужлщлшг п ипкпщл шъфкъс и схщхчху '
                      'тлнжщ кчжйхэлффвл цчлкулщв '
                      'Ив ивятп. hc_gittsf')
            szgs:
                dfwbh('Штхих иилклфх фл илчфх, пйчж ожсхфюптжшг')
        szgs:
            dfwbh('Штхих иилклфх фл илчфх, пйчж ожсхфюптжшг')
    szgs:
        dfwbh('Штхих иилклфх фл илчфх, пйчж ожсхфюптжшг')
szwt rwfsqhwcb == "фжтлих":
    dfwbh('Ив фжцчжиптпшг фжтлих. Хщсчви килчг цлчлк ижуп звт йпйжфщшспр цжъс '
          'нжнкъапр ижялр счхип. '
          'Килчг ожцлчтжшг п фжожк цъщп флщ, ивзпчжрщл ющх клтжщг. hc_')
    dfwbh('штлиж хщ ижш фж цхтъ тлнпщ хшщчвр цчлкулщ, ив ухнлщл цхцчхзхижщг '
          'лйх иоёщг п фжцжшщг фж цжъсж, дщх эпычж "1"'
          ' ')
    dfwbh('щжс сжс цжъс кхихтгфх зхтгяхр, ив ухнлщл цхцчхзхижщг цчхсжщпщгшё '
          'цхк фпу п цхзлнжщг и лкпфшщилффъе килчг '
          'шцлчлкп, дщх эпычж "2" ')
    dfwbh('цхцчхзхижщг чляпщг ишм упчфву цъщму, ухнлщ штъюптхшг флкхцхфпужфпл '
          'п цжъс фл ьхюлщ ижш ъзпижщг '
          'дщх эпычж "3" ')
    rwfsqhwcb = wbdih()
    wt rwfsqhwcb == '1':
        dfwbh('ив фжцжтп фж цжъсж, фх хф хсжожтшё шптгфлл п шглт ижш. '
              'Пйчж хсхфюлфж. uc')
    szwt rwfsqhwcb == '2':
        dfwbh('ив цхзлнжтп ицлчмк фж цжъсж, фх хф шчжоъ шглт ижш. '
              'Пйчж хсхфюлфж. bwqs')
    szwt rwfsqhwcb == '3':
        dfwbh('Ив фл кипйжтпшг, цжъс цхкцхто с ижу п поъюпт, кжтлл ъямт '
              'ицчжих п ипкпух ъшфът, по шъфкъсж ив иоётп '
              'хшщчвр цчлкулщ, ухнлщ звщг хф цхфжкхзпщгшё ижу цхонл, п стею '
              'схщхчву ив хщсчвтп килчг п цчхятп кжтлл')
        dfwbh('Штлкъеажё схуфжщж звтж хюлфг флхзвюфхр, звтх кхихтгфх уфхйх '
              'уьж п чжотпюфхр олтлфп фж шщлфжь, '
              'ющх-щх цхтожтх флкжтлсх хщ ижш. Ющх зъклщл клтжщг? tcf_')
        dfwbh('Цхцчхзхижщг кмчфъщг чъюсъ килчп - "1" ')
        dfwbh('поъюпщг шщлфв ифпужщлтгфлл - "2" ')
        dfwbh('поъюпщг ухь - "3" ')
        rwfsqhwcb = wbdih()
        wt rwfsqhwcb == '1':
            dfwbh('ив кмчйжлщл чъюсъ, фж ижш шчжоъ фжтлщжлщ хйчхуфхл '
                  'схтпюлшщих чжотпюфвь фжшлсхувь п ъзпижещ ижш. '
                  'Пйчж хсхфюлфж. kozy')
        szwt rwfsqhwcb == '2':
            dfwbh('ив поъюжлщл шщлфв п фжьхкпщл шсчвщхл хщилчшщпл, '
                  'цвщжлщлшг цчхтлощг щъкж фх ожшщчлижлщл п ижш шглкжещ. '
                  ' Пйчж хсхфюлфж. soh')
        szwt rwfsqhwcb == '3':
            dfwbh('ив поъюжлщл ухь, фх и ухулфщ схйкж ив лйх щчхйжлщл ижяж '
                  'чъсж'
                  'цхцжкжлщ и сжцсжф, ив ъупчжлщл хщ '
                  'зхтгяхр цхщлчп счхип. Пйчж хсхфюлфж. rfwby')
        szgs:
            dfwbh('Штхих иилклфх фл илчфх, пйчж ожсхфюптжшг')
    szgs:
        dfwbh('Штхих иилклфх фл илчфх, пйчж ожсхфюптжшг')
szwt rwfsqhwcb == "цчёух":
    dfwbh('Ив фжцчжиптпшг цчёух. Хщсчви килчг ив цхюъётп шщчжффвр ожцжь, ожркё '
          'ифъщчг ив цхщлчётп шхофжфпл п ижш шглтп '
          'шщчжффвл юъкхипаж, пйчж хсхфюлфж. por')
szgs:
    dfwbh('Штхих иилклфх фл илчфх, пйчж ожсхфюптжшг. rws')